# Програма запитує введення, з клавіатури, цілі числа,
# поки не буде введено 0. Як тільки буде введено 0 (нуль),
# програма повинна порахувати та вивести на екран:
#
# -кількість введених чисел (завершальний 0 не рахується)
# -їхню суму
# -середнє арифметичне всіх введених чисел (за винятком завершального числа 0)
# -визначити максимальне та мінімальне значення
# -визначити кількість парних та непарних елементів у послідовності


if __name__ == "__main__":
    nums = []
    while (num := int(input("Num:"))) != 0:
        nums.append(num)

    print("sum_num", sum(nums))
    print("count_num", len(nums))
    print("max_num", max(nums))
    print("min_num", min(nums))
    print("average", sum(nums) / len(nums))
